<template>
  <div>
    <h1>数字千年版权法案（DMCA）</h1>
    <p>
      {{ us }}尊重他人的知识产权，也尊重我们用户的知识产权。如果您坚信自己的作品被盗用，并侵犯了您的产权，请发邮件到 dmca@{{ siteUrl }}。
    </p>
    <p>
      {{ us }}将立刻处理并调查侵权事件，并且根据数字千年版权法（“DMCA”）及其他使用的知识产权保护法采取适当的措施。收到通知后，{{ us }}将依据或大体上依据 DMCA 对侵权的材料进行移除或禁止访问。屡次侵犯第三方的版权，在适当情况下将会导致使用终止。
    </p>
    <p>
      在评估一个 {{ siteName }} 用户是否侵犯您的版权时，要记住 Scratch 的教育意义和 {{ siteName }} 的非营利性，它是为了通过为孩子提供工具而帮助他们使用数字科技来学习和表达自己。
    </p>
    <p>
      我们希望您也能知道，{{ siteName }} 不仅可以普及您的创作或网站，它也是为孩子的教育做好事的机会。
    </p>
    <p>
      如果您决定要进行侵犯版权的投诉，请注意，我们可能会在 lingeffects.org 等信息搜集网站张贴您的通知，并且会有个人识别信息出现。另外，如果您对于侵权的材料进行伪造，则需要对造成的损失负责（如律师费等）。
    </p>
    <h2>抗辩通知</h2>
    <p>
      如果您的内容因 DMCA 通知而被删除，您认为自己拥有使用该材料的合法权利，并且您希望在法律上对此声明提出异议，则可以提交 DMCA 抗辩通知。 只有在内容被错误删除，而且您愿意前往法庭对使用权进行辩护时，您才应该提交抗辩通知。
    </p>
    <p>
      DMCA 抗辩通知可以通过电子邮件发送至 dmca@{{ siteUrl }}。
    </p>
    <p>
      抗辩通知必须包括：
    </p>
    <p>
      <ul>
        <li>您的全名</li>
        <li>您的地址</li>
        <li>您的电话号码</li>
        <li>您的电子邮件地址</li>
        <li>您的 {{ siteName }} 的账号名称</li>
        <li>被删除的项目的链接</li>
        <li>内容被错误删除且愿意承担伪证责任的声明</li>
        <li>同意您居住地区的管辖权的声明</li>
        <li>您的签名</li>
      </ul>
    </p>
    <p>
      收到有效的 DMCA 抗辩通知后，{{ us }} 将与您提出的原始侵权索赔人共享您提供的信息。如果他们选择向您提起诉讼，他们将能够使用此信息与您联系或通知您。
    </p>
    <p>
      如果我们在向提交 DMCA 删除通知的人提供反通知后 10 个工作日内未收到有关提起诉讼的通知，则将恢复对已删除的内容的访问。
    </p>
    <h2>重复侵权者</h2>
    <p>
      按照 DMCA 要求，对于重复侵犯版权的行为将被禁止访问我们的服务。如果我们收到符合 DMCA 标准的针对某人的移除通知，并且该人未提交抗辩通知，则会在其帐号中添加警示。在收到 3 次的申诉后，就会停止该帐户，并采取标准措施阻止其访问 Scratch。在收到 DMCA 下架通知后 10 个工作日内我们会评估，被申诉方不会被阻止访问，以确保有审查问题并提交回复通知的机会。
    </p>
  </div>
</template>

<script>
export default {
  data: () => ({
    name: 'GitScratch 和 UniScratch',
    us: 'GitScratch 团队',
    editorDeveloper: 'UniScratch 团队',
    editor: 'UniScratch',
    siteName: 'GitScratch',
    siteUrl: 'git.sc.cn'
  }),
  head () {
    return {
      title: 'DMCA'
    }
  }
}
</script>
