<template>
  <div>
    <h1>{{ name }} 服务条款</h1>
    <p>
      感谢您使用 {{ name }}！我们很高兴在这里与您邂逅。在访问或使用 {{ name }} 之前，请仔细阅读本服务条款协议。由于它是我们与用户之间的重要合同，因此我们尽可能明确阐述。为方便起见，我们在列出完整的法律条款之前，用简短的非约束性摘要介绍这些条款。<br>
      如果您使用 {{ name }}，您同意接受本服务条款的所有条款。如果您不同意本服务条款的任何内容，您应立即停止使用 {{ name }}。
    </p>
    <h2>
      0. 词汇解释
    </h2>
    <p>
      0.1 {{ us }}：指 <a href="https://github.com/orgs/UniScratch/teams/gitscratch-team/" target="_blank">{{ us }}</a>的所有成员。以下简称为“我们”。
    </p>
    <p>
      0.2 {{ editor }}：指由 {{ editorDeveloper }}基于 <a href="https://scratch.mit.edu/" target="_blank">Scratch</a> 二次开发的 {{ editor }} 编辑器。
    </p>
    <p>
      0.3 {{ siteName }}：指由 {{ us }}开发的使用 {{ editor }} 编辑器的社区网站 <a href="https://git.sc.cn/" target="_blank">{{ siteUrl }}</a>。
    </p>
    <h2>
      1. 用户协议
    </h2>
    <p>
      1.1 这些使用条款构成您与 {{ us }}之间的协议，该协议管理您对 {{ siteUrl }} 和所有相关服务的使用，包括但不限于 {{ siteName }} 网站和 {{ editor }} 编辑器。请仔细阅读使用条款。通过使用 {{ name }}，您确认您已阅读、理解并接受使用条款中的条款和条件。如果您不同意这些条件中的任何一个，请不要使用 {{ name }}。
    </p>
    <p>
      1.2 您的隐私对我们很重要。请阅读我们的隐私政策，其中明确了我们如何使用、收集和存储通过服务收集的信息。通过使用 {{ name }}，您还同意您对 {{ name }} 的隐私政策感到满意。
    </p>
    <p>
      1.3 {{ siteName }} 对所有年龄段的儿童和成人开放，我们要求您在使用 {{ siteName }} 服务时牢记这一点。当您使用 {{ siteName }} 时，您同意遵守 {{ siteName }} 社区准则。
    </p>
    <p>
      1.4 我们可能会不时更改使用条款。您始终可以在 https://git.sc.cn/help/terms-of-service 找到最新版本的使用条款。最近修订的日期将显示在此页面上。您继续使用服务即表示您接受对使用条款的任何更改或修订。
    </p>
    <h2>
      2. 帐户创建和维护
    </h2>
    <p>
      2.1 为了使用服务的某些功能，您需要在 {{ siteName }} 注册并创建一个帐户。创建帐户是可选的，但没有帐户您将无法在 {{ siteName }} 上保存或发布项目或评论。注册个人帐户时，您将被要求提供某些个人信息，例如您的电子邮件地址。有关 {{ siteName }} 的数据保留和使用政策，请参阅 {{ siteName }} 的隐私政策。
    </p>
    <p>
      2.2 您有责任对您的密码保密并确保您的帐户安全。您对您帐户的任何使用负全部责任，即使您的帐户被其他人使用。如果对您帐户的任何使用违反了服务条款，您的帐户可能会被暂停或删除。
    </p>
    <p>
      2.3 未经许可，您不得使用他人的 {{ siteName }} 帐户。
    </p>
    <p>
      2.4 帐户名称不能更改。如果您想要不同的帐户名称，请创建一个新帐户并手动复制现有项目。
    </p>
    <p>
      2.5 如果您有理由相信您的帐户不再安全 (例如，在丢失、被盗或未经授权的情况下泄露您的密码) ，请立即更改您的密码。如果您无法访问您的帐户来更改密码，请通过 help@scratch.mit.edu 通知我们。
    </p>
    <h2>
      3. 使用规则
    </h2>
    <p>
      3.1 我们支持言论自由。但是，{{ siteName }} 面向广大受众，有些内容不适合 {{ siteName }} 社区。您不得以以下任何方式使用 {{ name }} 服务，即：
    </p>
    <p>
      <ul>
        <li>宣扬对任何个人或团体的偏见、歧视、仇恨或暴力；</li>
        <li>威胁、骚扰或恐吓任何其他人，无论该人是否是 {{ name }} 用户；</li>
        <li>包含粗俗语言或人身攻击；</li>
        <li>包含色情或图形暴力的材料；</li>
        <li>提供有关如何进行非法活动或获取非法产品的说明；</li>
        <li>除非与组织 {{ name }} 活动有关，否则要求任何其他用户提供个人隐私信息；</li>
        <li>未经他人许可，公开任何其他人的个人隐私信息。</li>
      </ul>
    </p>
    </p>
    <p>
      3.2 您同意在使用 {{ name }} 时遵守所有适用的法律法规。您不得以任何非法方式使用 {{ name }}，包括骚扰、跟踪或诽谤任何其他人。
    </p>
    <p>
      3.3 您在使用 {{ name }} 服务时不得冒充、模仿或冒充他人。
    </p>
    <p>
      3.4 您同意不以任何方式使用 {{ name }} 来破坏服务、未经授权访问服务或干扰任何其他用户使用服务的能力。禁止的活动包括但不限于：
    </p>
    <p>
      <ul>
        <li>发布故意设计为使 {{ siteName }} 网站或 {{ editor }} 崩溃的内容；</li>
        <li>链接到包含病毒或恶意软件的页面；</li>
        <li>使用管理员密码或冒充管理员；</li>
        <li>重复发布相同的材料，或“垃圾邮件”；</li>
        <li>使用备用帐户或组织投票组来操纵网站统计数据，例如故意多次访问作品展示页面。</li>
      </ul>
    </p>
    </p>
    <p>
      3.5 根据 <a href="https://creativecommons.org/licenses/by-sa/2.0/">CC BY-SA 2.0 许可</a>，允许将 {{ siteName }}、用户生成的内容和支持材料用于商业用途。然而，我们保留阻止我们自行决定对社区有害的任何商业用途的权利。有害的商业用途包括通过项目、评论或论坛帖子发送垃圾邮件或重复广告。
    </p>
    <p>
      3.6 您同意不会在 {{ siteName }} 网站之外发布任何内容的链接，如果这样做会违反使用条款的任何部分。
    </p>
    <h2>
      4. 用户生成的内容和许可
    </h2>
    <p>
      4.1 就使用条款而言，“用户生成的内容”包括用户提交给 {{ siteName }} 的任何项目、评论、论坛帖子或第三方网站的链接。
    </p>
    <p>
      4.2 我们鼓励大家通过自由分享代码、艺术、音乐和其他作品来培养创造力。但是，我们也理解个人和公司保护其知识产权的必要性。您有责任确保您对提交给 {{ siteName }} 的任何用户生成的内容拥有必要的权利、许可或许可。
    </p>
    <p>
      4.3 您提交给 {{ siteName }} 的所有用户生成的内容均根据 <a href="https://creativecommons.org/licenses/by-sa/2.0/">CC BY-SA 2.0 许可</a>授权给我们。这允许其他人查看和改编您的内容。此许可还允许我们在 {{ siteName }} 网站、社交媒体渠道和其他地方展示、分发和复制您的内容。如果您不想在此许可下许可您的内容，请不要在 {{ siteName }} 上共享它。
    </p>
    <p>
      4.4 您只能提交使用 {{ editor }} 编辑器或从第 5.3 节中描述的由未经修改的源代码编译的 {{ editor }} 编辑器副本创建的用户生成项目。由您或其他任何人修改的 Scratch 编辑器创建的项目可能无法正常在 {{ siteName }}上发布。
    </p>
    <p>
      4.5 虽然我们要求所有用户遵守这些使用条款，但可能会在 {{ siteName }} 网站上提交和显示一些不适当的用户生成内容。您了解，当您使用 {{ siteName }} 时，您可能会接触到令人反感或冒犯的用户生成内容。如果您发现任何违反社区准则或使用条款的内容，请使用“举报”按钮告知我们。您只需报告一个项目一次。我们会尽力审查报告的内容。
    </p>
    <p>
      4.6 除了审查报告的用户生成内容外，我们保留监督 {{ name }} 服务的所有使用的权利，但没有义务。我们可以编辑、移动或删除任何违反使用条款或社区准则的内容，恕不另行通知。
    </p>
    <p>
      4.7 所有用户生成的内容均按原样提供。我们不对通过 {{ siteName }} 提供的任何用户生成内容的准确性或可靠性做出任何保证。我们对于用户生成的内容中表达的任何观点、意见或建议持中立态度。您同意免除我们因您的用户生成内容而产生的任何和所有责任。
    </p>
    <h2>
      5. {{ name }} 内容和许可
    </h2>
    <p>
      5.1 除任何用户生成的内容外,我们拥有并保留对 {{ name }} 代码、{{ name }} 的设计、功能和架构以及通过 {{ name }} 提供的任何软件或内容 (统称为“{{ name }} IP”) 的所有权利。如果您想以本使用条款不允许的方式使用 {{ name }}，您必须首先联系我们。除了根据这些使用条款明确授予的任何权利外，您没有被授予任何 {{ name }} IP 的任何权利。
    </p>
    <p>
      5.2 {{ name }} 提供支持材料，包括图像、声音、视频和示例代码，以帮助用户构建项目。支持材料根据 <a href="https://creativecommons.org/licenses/by-sa/2.0/">CC BY-SA 2.0 许可</a>进行许可。您也可以在同一许可下使用 {{ name }} 的屏幕截图。请注意，这不适用于也由我们或其他方注册商标的材料，如下文第 5.4 和 5.5 部分所述。<br>
      <a href="https://creativecommons.org/licenses/by-sa/2.0/">CC BY-SA 2.0 许可</a>要求您将使用的任何材料归于原作者。当您使用 {{ name }} 支持材料或 {{ name }} 网站的截图时，请使用以下署名：“{{ name }} 由 {{ us }} 开发。参见 https://git.sc.cn/。”
    </p>
    <p>
      5.3 {{ name }} 的源代码可供下载，并受我们所示的版权声明的约束。
    </p>
    <!-- <p>
      5.4 {{ name }} 名称、{{ name }} 标志是我们拥有的商标。MIT 名称和徽标是麻省理工学院拥有的商标。除非您根据特定的许可计划或协议获得 {{ name }} 的许可，否则您不得使用这些徽标来标记、宣传或认可任何产品或服务。您可以使用 {{ name }} 徽标来指代 {{ name }} 网站和编程语言。
    </p> -->
    <p>
      5.4 {{ name }} 支持材料库可能包含由第三方注册商标的图像和声音。材料包含在 {{ name }} 支持材料库中这一事实不会以任何方式限制或减少知识产权，包括商标权，否则材料所有者可以使用这些材料。这些使用条款或知识共享 2.0 许可中的任何内容均不得解释为限制或减少任何一方对其有效商标的权利。您不得使用这些材料来标记、宣传或认可任何产品或服务。您对因滥用这些材料而导致的任何侵犯第三方知识产权的行为负全部责任。
    </p>
    <h2>
      6. 数字千年版权法案 (DMCA)
    </h2>
    <p>
      6.1 如果您是版权所有者，并且认为 {{ name }} 上的内容侵犯了您的权利，您可以向我们发送 DMCA 通知。有关更多信息，包括 DMCA 通知中必须包含的信息，请参阅我们的完整 DMCA 政策和 DMCA 文本，<router-link to="/help/dmca">
        https://git.sc.cn/help/dmca/
      </router-link>。
    </p>
    <p>
      6.2 如果您是 {{ name }} 用户，并且您认为您的内容不构成侵犯版权并被错误删除，您可以向我们发送通知。请包括：
      您的 {{ siteName }} 用户名和电子邮件地址；
      您认为被错误删除的具体内容；
      您认为没有侵犯版权的原因 (例如，该内容没有版权，您有权使用该内容，或者您对该内容的使用是“合理使用”) 。
    </p>
    <h2>
      7. 暂停和终止帐户
    </h2>
    <p>
      7.1 {{ name }} 有权因违反使用条款或社区准则而暂停您的帐户。屡次违规者可能会被删除其帐户。我们保留确定违反使用条款或社区准则的唯一权利。我们还保留终止任何用于规避先前执行使用条款的帐户的权利。
    </p>
    <p>
      7.2 如果您想删除或暂时禁用您的帐户，请联系我们。
    </p>
    <h2>
      8. 第三方网站
    </h2>
    <p>
      8.1 {{ name }} 上的内容，包括用户生成的内容，可能包括第三方网站的链接。我们无法审查或管理第三方网站，并且对第三方网站的隐私实践、内容或功能不承担任何责任。您同意免除我们因第三方网站引起的任何和所有责任。
    </p>
    <h2>
      9. 赔偿
    </h2>
    <p>
      您同意赔偿 {{ us }} 及其所有附属机构、员工、教职员工、研究员、学生、代理人、代表、第三方服务提供商及其理事会成员，并保护他们每个人免受因您违反服务条款或使用 {{ name }} 引起的或与之相关的任何和所有索赔和责任 (包括律师费) 。
    </p>
    <!-- <p>
      对于政府机构，使用条款中有关赔偿的规定不适用于您的官方用途，除非法律明确授权。对于美国的州和地方政府机构，与赔偿有关的使用条款仅在您所在司法管辖区的法律授权的范围内适用于您的官方使用。
    </p> -->
    <h2>
      10. 免责声明
    </h2>
    <p>
      您承认使用 {{ name }} 需要您自担风险。{{ name }} 按“原样”提供，我们在此明确否认任何和所有明示和暗示的保证，包括但不限于对准确性、可靠性、所有权、适销性、非侵权、适用于特定目的或任何其他口头、书面或电子形式的保证、条件、保证或陈述，包括但不限于其中包含或由我们提供的任何信息的准确性或完整性。在不限制上述规定的情况下，我们拒绝就用户生成的内容作出任何和所有明示和暗示的保证。我们及其第三方服务提供商不声明或保证对 {{ siteName }} 的访问不会中断，或者传输的信息不会出现故障、错误或遗漏或丢失，或者不会通过 {{ name }} 服务传播任何病毒。
    </p>
    <h2>
      11. 责任限制
    </h2>
    <p>
      我们不对您或任何第三方承担任何直接、间接、特殊、后果性或任何形式的惩罚性损害赔偿，无论索赔的类型或诉讼因由的性质如何，即使我们已经被告知此类损害的可能性。在不限制前述规定的情况下，我们不对您或任何第三方因用户生成的内容引起的损害或损害承担任何责任。
    </p>
    <h2>
      12. 管辖权
    </h2>
    <p>
      {{ siteName }} 由我们在其位于中国香港特别行政区的服务器提供。我们不表示 {{ name }} 适合或可用于其他地方。访问或使用 {{ name }} 的人有责任遵守当地法律。
    </p>
    <h2>
      13. 法律和地点的选择
    </h2>
    <p>
      您同意，出于所有目的，这些使用条款应受中华人民共和国法律的管辖和解释，该法律适用于将在其中完全履行的合同，以及基于、相关或声称违反以下条款的任何行为使用条款必须提交给中国政府。此外，双方同意服从此类法院的专属属人管辖权和审判地。
    </p>
    <!-- <p>
      如果您是美国的联邦、州或地方政府实体，以您的官方身份使用 {{ siteName }}，并且在法律上无法接受上述控制法律、管辖权或地点条款，则这些条款不适用于您。对于此类美国联邦政府实体，这些条款以及与之相关的任何行动将受美利坚合众国法律 (不涉及法律冲突) 的管辖，并且在没有联邦法律的情况下并在联邦法律允许的范围内，马萨诸塞州联邦法律 (不包括法律选择) 。
    </p> -->
    <h2>
      14. 语言选择
    </h2>
    <p>
      如果我们为您提供了这些使用条款、隐私政策或任何其他政策的简体中文版本的翻译，则您同意该翻译仅供参考，不会修改简体中文版本。如果翻译版本与简体中文版本发生冲突，以简体中文版本为准。
    </p>
    <h2>
      15. 不弃权
    </h2>
    <p>
      放弃本使用条款的任何条款不应被视为对该条款或任何其他条款的进一步或持续放弃，并且我们未能主张本使用条款下的任何权利或规定不构成对该权利的放弃或规定。
    </p>
    <h2>
      16. 完整协议
    </h2>
    <p>
      本文档连同所有附录构成完整的使用条款，并取代之前与我们就使用 {{ name }} 达成的所有协议。
    </p>
    <p>
      修订日期：2022 年 6 月。
    </p>
  </div>
</template>

<script>
export default {
  data: () => ({
    name: 'GitScratch 和 UniScratch',
    us: 'GitScratch 团队',
    editorDeveloper: 'UniScratch 团队',
    editor: 'UniScratch',
    siteName: 'GitScratch',
    siteUrl: 'git.sc.cn'
  }),
  head () {
    return {
      title: '服务条款'
    }
  }
}
</script>
